Jiangchunjun/Project_NFC_1_10V/Application/src/hwdrivers/XMC1300/xmc1300_boostpfc_buck_hwdriver.c
// ---------------------------------------------------------------------------------------------------------------------
// XMC1300 hardware driver for BoostPFC and Buck for OTi NONSELV Generation 2 ballasts
// ---------------------------------------------------------------------------------------------------------------------
// (c) Osram GmbH
//     LE D - M
//     Parkring 33
//     85748 Garching
//
//
// The content of this file is intellectual property of OSRAM GmbH. It is
// confidential and not intended for any public release. All rights reserved.
//
//
// Indent style: Replace tabs by spaces, 2 spaces per indentation level
//
// Initial version: O. Busse, M. Gerber, 2014-06
// $Author: c.schwarzfischer $
// $Revision: 10381 $
// $Date: 2017-10-19 19:21:16 +0800 (Thu, 19 Oct 2017) $
// $Id: xmc1300_boostpfc_buck_hwdriver.c 10381 2017-10-19 11:21:16Z c.schwarzfischer $
// $URL: https://app-ehnsvn02.int.osram-light.com/svn/EC/Platforms/10%20Isolated/OT%20PSE%20DALI/branches/20180612_DALI_Update/src/hwdrivers/XMC1300/xmc1300_boostpfc_buck_hwdriver.c $

/*******************************************************************************************************************//**
* @file
* @brief XMC1300 hardware driver for BoostPFC and Buck module (for PCB since ZNN-3030986-000-02)
  @image html xmc1300_boostpfc_hwdriver_PFC_timer_configuration.jpg "BoostPFC timer configuration of XMC1300"
***********************************************************************************************************************/

#ifdef __ICCARM__

#define HWDRIVER_BOOSTPFC
#define HWDRIVER_BUCK

#include <stdbool.h>

#include "gpio_xmc1300_tssop38.h" // to set ports, etc.
#include "xmc1300.h"              // for macros SET_BIT, WR_REG, etc.
#include "boostpfc_hal.h"
//#include "buck_hal.h"
#include "boostpfc_parameters.h"
#include "boostpfc_userinterface.h"
//#include "buck_parameters.h"
//#include "buck_userinterface.h"
//#include "intrinsics.h"

//----------------------------------------------------------------------------------------------------------------------
// INTERNAL DEFINES
#define PFC_ON_MIN      2           // 31,25ns@64MHz -> no gate drive, only VCCO is supplied by VCCH/VCCL
#define PFC_DEMAG_MAX   6400        // 100us@64MHz -> to keep monostable flip flop of FAN3182 active, so that FAN3182 stays in steady-state
#define PFC_DEMAG_MAX_INTERMEDIATE      128
#define PFC_DEMAG_MAX_SURGE  640

#define P0_3_SET_MODE(mode)         \
    PORT0->IOCR0 &= ~0xf8000000UL;  \
    PORT0->IOCR0 |= (mode) << 24;

#define P0_4_SET_MODE(mode)         \
    PORT0->IOCR4 &= ~0x000000f8UL;  \
    PORT0->IOCR4 |= (mode) << 0;

#define CC80_ST_MASK (CCU8_GCST_CC80ST1_Msk | CCU8_GCST_CC80ST2_Msk)
#define CC81_ST_MASK (CCU8_GCST_CC81ST1_Msk | CCU8_GCST_CC81ST2_Msk)

//----------------------------------------------------------------------------------------------------------------------
static volatile uint32_t comparator_events;          // counter for number of overcurrent comparator events  // don't delete volatile here!
static uint32_t boostpfc_deepsleep_requested;
static uint32_t buck_deepsleep_requested;
//extern bool buck_module_adc_active;
bool m_CCU8_power_status;

//----------------------------------------------------------------------------------------------------------------------
// INTERNAL FUNCTIONS
static void BoostPFC_Buck_HwCAPCOM8Init (void);  // initialize CAPCOM 8 timer unit for boostPFC and buck
static void BoostPFC_Buck_HwCAPCOM8Start (void); // start CAPCOM 8 timer unit for boostPFC and buck
static void BoostPFC_Buck_HwCAPCOM8Stop (void);  // stop CAPCOM 8 timer unit for boostPFC and buck
static void BoostPFC_Buck_HwCAPCOM4Init (void);  // initialize CAPCOM 4 timer unit for buck
static void BoostPFC_Buck_HwInit (void);
static void BoostPFC_Buck_HwDeepsleep2Ready (void);
static void BoostPFC_Buck_HwReady2Deepsleep (void);
static void BoostPFC_HwCC82Init (void);          // initialize CC82 timer slice for boostPFC
static void Buck_HwCC42Init (void);              // initialize CC42 timer slice for aux timer (anti-glow MOSFET gate drive)
#if REMOVED_CODE
static void Buck_HwERUInit (void);               // initialize Event Request Unit for buck
static void BoostPFC_Buck_HwComparatorInit (void);        // initialize analog comparators for buck
static void BoostPFC_Buck_HwComparatorEnable (void);      // enable analog comparators for buck
static void BoostPFC_Buck_HwComparatorDisable (void);     // disable analog comparators for buck
static void Buck_HwPOSIFInit (void);             // initialize Position Interface for synchronized timer update of buck
static void Buck_HwPOSIFEnable (void);           // start Position Interface for synchronized timer update of buck
static void Buck_HwPOSIFDisable (void);          // stop Position Interface for synchronized timer update of buck
static void Buck_HwCC43Init (void);              // initialize CC43 timer slice for buck (PWM)
static void Buck_HwCC80Init (void);              // initialize CC80 timer slice for buck (low side switch)
static void Buck_HwCC81Init (void);              // initialize CC81 timer slice for buck (high side swtich)
static void Buck_HwCC83Init (void);              // initialize CC83 timer slice for buck (Capturing)
void SCU_2_IRQHandler(void);                    // Interrupt Service Routine for buck overcurrent
void CCU40_3_IRQHandler(void);
void CCU80_0_IRQHandler(void);
void POSIF0_0_IRQHandler(void);
#endif

//----------------------------------------------------------------------------------------------------------------------

/* internal function */
/* global configuration of CAPCOM8 timer unit */
static void BoostPFC_Buck_HwCAPCOM8Init (void)
{
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C0UL;                              // disable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(SCU_CLK->CGATCLR0, SCU_CLK_CGATCLR0_CCU80_Pos);                    // Disable clock gating of CCU80
    while ((uint32_t)SCU_CLK->CLKCR & (uint32_t)SCU_CLK_CLKCR_VDDC2LOW_Msk) {} // Wait until VDDC is stabilized (16us, because CLKCR.CNTADJ=0x3FF: ref. to XMC1300 AA-Step Reference Manual V1.1 2014-04 page 284 & PWMSP001 [1.0.34] -> CCU4Global_lInit())
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C3UL;                              // enable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(CCU80->GIDLC,CCU8_GIDLC_SPRB_Pos);                                 // Set the Pre-scalar run bit

    // global CAPCOM8 initialization
    CCU80->GCTRL  = ( 1 << CCU8_GCTRL_MSE0_Pos) |    // enable shadow transfer request via the CCU8x.MCSS input for CC80 (low side timer)
                    ( 1 << CCU8_GCTRL_MSE1_Pos) |    // enable shadow transfer request via the CCU8x.MCSS input for CC81 (high side timer)
                    ( 3 << CCU8_GCTRL_MSDE_Pos) ;    // also request shadow transfer for dither compare value via the MCSS input
//                  ( 4 << CCU8_GCTRL_PRBC_Pos) ;    // GSTAT.PRB and prescaler registers are cleared when Run Bit of CC83 is cleared
}


