Jiangchunjun/Project_NFC_1_10V/Application/src/hwdrivers/XMC1300/xmc1300_boostpfc_buck_hwdriver.c
/* internal function */
/* start CAPCOM8 timer unit */
static void BoostPFC_Buck_HwCAPCOM8Start (void)
{
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C0UL;                              // disable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(SCU_CLK->CGATCLR0, SCU_CLK_CGATCLR0_CCU80_Pos);                    // Disable clock gating of CCU80
    while ((uint32_t)SCU_CLK->CLKCR & (uint32_t)SCU_CLK_CLKCR_VDDC2LOW_Msk) {} // Wait until VDDC is stabilized (16us, because CLKCR.CNTADJ=0x3FF: ref. to XMC1300 AA-Step Reference Manual V1.1 2014-04 page 284 & PWMSP001 [1.0.34] -> CCU4Global_lInit())
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C3UL;                              // enable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(CCU80->GIDLC,CCU8_GIDLC_SPRB_Pos);                                 // Set the Pre-scalar run bit

    m_CCU8_power_status = true;
}


/* internal function */
/* stop CAPCOM8 timer unit */
static void BoostPFC_Buck_HwCAPCOM8Stop (void)
{
    SET_BIT(CCU80->GIDLS,CCU8_GIDLS_CPRB_Pos);                                  // clear the Pre-scalar run bit
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C0UL;                               // disable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(SCU_CLK->CGATSET0, SCU_CLK_CGATSET0_CCU80_Pos);                     // Enable clock gating of CCU80
    while ((uint32_t)SCU_CLK->CLKCR & (uint32_t)SCU_CLK_CLKCR_VDDC2HIGH_Msk) {} // Wait until VDDC is stabilized (16us, because CLKCR.CNTADJ=0x3FF: ref. to XMC1300 AA-Step Reference Manual V1.1 2014-04 page 284)
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C3UL;                               // enable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1

    m_CCU8_power_status = false;
}


/* internal function */
/* global configuration of CAPCOM4 timer unit for aux timer (attention: DALI also uses CAPCOM4) */
static void BoostPFC_Buck_HwCAPCOM4Init (void)
{
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C0UL;                              // disable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(SCU_CLK->CGATCLR0, SCU_CLK_CGATCLR0_CCU40_Pos);                    // Disable clock gating of CCU80
    while ((uint32_t)SCU_CLK->CLKCR & (uint32_t)SCU_CLK_CLKCR_VDDC2LOW_Msk) {} // Wait until VDDC is stabilized (16us, because CLKCR.CNTADJ=0x3FF: ref. to XMC1300 AA-Step Reference Manual V1.1 2014-04 page 284 & PWMSP001 [1.0.34] -> CCU4Global_lInit())
    SCU_GENERAL->PASSWD = (uint32_t)0x000000C3UL;                              // enable bit protection scheme for SCU_CLKCR, SCU_CGATSET0, SCU_CGATCLR0, SCU_ANAOFFSET, VADC0_ACCPROT0, VADC0_ACCPROT1
    SET_BIT(CCU40->GIDLC,CCU4_GIDLC_SPRB_Pos);                                 // Set the Pre-scalar run bit
}


void BoostPFC_Buck_HwInit (void)
{
    static uint32_t init_flag = 0;
    if (init_flag == 0)
    {
        comparator_events = 0;          // counter for number of overcurrent comparator events
        boostpfc_deepsleep_requested = 1;
        buck_deepsleep_requested = 1;

        BoostPFC_Buck_HwCAPCOM8Init(); // start and configure CAPCOM8
#if REMOVED_CODE
        Buck_HwCC80Init();             // configure timer slice for low side switch
        Buck_HwCC81Init();             // configure timer slice for high side switch
        Buck_HwCC83Init();             // configure timer slice for capturing buck
#endif

        BoostPFC_HwCC82Init();         // configure timer slice for boost
        BoostPFC_Buck_HwCAPCOM4Init(); // start and configure CAPCOM4
        Buck_HwCC42Init();             // configure timer slice for Anti-Glow switch

#if REMOVED_CODE
        Buck_HwCC43Init();             // configure timer slice for PWM
#endif

        BoostPFC_Buck_HwCAPCOM8Stop();   // stop CAPCOM8

#if REMOVED_CODE
        BoostPFC_Buck_HwComparatorInit();       // configure comparators (for ZCD, overcurrent)
        Buck_HwERUInit();              // configure event request unit (for ZCD, overcurrent, timers)
        Buck_HwPOSIFInit();            // configure position interface (for correctly timed timer update)
#endif
        init_flag = 1;
    }
}


//attention! while loop until VDDC is stabilized --> Buck_HwDeepsleep2Ready shall not be called during run mode of the ballast!
void BoostPFC_Buck_HwDeepsleep2Ready (void)
{
    BoostPFC_Buck_HwCAPCOM8Start();                               // start CAPCOM8

#if REMOVED_CODE
    BoostPFC_Buck_HwComparatorEnable();                           // enable comparators (for overcurrent and ZCD)
    Buck_HwPOSIFEnable();                                         // enable POSIF for synchronized timer update
#endif

    CCU80_CC81->SWR = 0x00000F3FU;                                // CC81: clear all interrupts
    SET_BIT(CCU80->GIDLC, CCU8_GIDLC_CS1I_Pos);                   // CC81: clear IDLE state
    CCU80_CC80->SWR = 0x00000F3FU;                                // CC80: clear all interrupts
    SET_BIT(CCU80->GIDLC, CCU8_GIDLC_CS0I_Pos);                   // CC80: clear IDLE state
    CCU80_CC83->SWR = 0x00000F3FU;                                // CC83: clear all interrupts
    SET_BIT(CCU80->GIDLC, CCU8_GIDLC_CS3I_Pos);                   // CC83: clear IDLE state
    CCU40_CC43->SWR = 0x00000F3FU;                                // CC43: clear all interrupts
    SET_BIT(CCU40->GIDLC, CCU4_GIDLC_CS3I_Pos);                   // CC43: clear IDLE state
    CCU80_CC82->SWR = 0x00000F3FU;                                // CC82: clear all interrupts of CC82
    SET_BIT(CCU80->GIDLC, CCU8_GIDLC_CS2I_Pos);                   // CC82: clear IDLE state of CC82
    BoostPFC_HwUpdateTimer (PFC_ON_MIN, 0, PFC_DEMAG_MAX);        // GDI pulses to keep FAN3182 in run mode, no gate drive
    P0_9_set_mode(OUTPUT_PP_AF5);                                 // set P0.9  (PFC_GATE) to CCU80.OUT21
    P0_11_set_mode(OUTPUT_OD_AF5);                                // set P0.11 (PFC_RETRIGGER_GATING) to CCU80.OUT23
    SET_BIT(CCU80_CC82->TCSET, CCU8_CC8_TCSET_TRBS_Pos);          // set timer run bit for CC82 -> start the boost timer
}


void BoostPFC_Buck_HwReady2Deepsleep (void)
{
    if ((boostpfc_deepsleep_requested) &&  (buck_deepsleep_requested))
    {
        P0_9_set_mode(OUTPUT_PP_GP);                                 // set P0.9  (PFC_GATE) to GPIO
        P0_9_reset();                                                // set P0.9  (PFC_GATE) to low
        P0_11_set_mode(OUTPUT_OD_GP);                                // set P0.11 (PFC_RETRIGGER_GATING) to GPIO
        P0_11_reset();                                               // set P0.11 (PFC_RETRIGGER_GATING) to low
        SET_BIT(CCU80_CC82->TCCLR, CCU8_CC8_TCCLR_TRBC_Pos);         // clear timer run bit -> stops the timer
        SET_BIT(CCU80->GIDLS, CCU8_GIDLS_SS2I_Pos);                  // set IDLE state of CC82
        SET_BIT(CCU80->GIDLS, CCU8_GIDLS_SS3I_Pos); // CC83: set IDLE state

