Jiangchunjun/Project_NFC_1_10V/Application/src/hwdrivers/XMC1300/xmc1300_boostpfc_buck_hwdriver.c
        // NOTE: is CCU42 still used? Probably not...
        SET_BIT(CCU40->GIDLS, CCU4_GIDLS_SS2I_Pos); // CC42: set IDLE state

        SCU_INTERRUPT->SRMSK &= ~(uint32_t)SCU_INTERRUPT_SRMSK_ORC1I_Msk; // disable the interrupt trigger source
        SCU_INTERRUPT->SRMSK &= ~(uint32_t)SCU_INTERRUPT_SRMSK_ORC2I_Msk; // disable the interrupt trigger source
        SCU_INTERRUPT->SRMSK &= ~(uint32_t)SCU_INTERRUPT_SRMSK_ORC3I_Msk; // disable the interrupt trigger source

#if REMOVED_CODE
        BoostPFC_Buck_HwComparatorDisable();                 // disable comparators
        Buck_HwPOSIFDisable();                      // disable position interface
#endif
    }
}

void BoostPFC_Buck_Hw_turn_off_CCU8( void )
{
    BoostPFC_Buck_HwCAPCOM8Stop();              // shut-down CCU8, if not required by buck
    m_CCU8_power_status = false;

}

bool BoostPFC_Buck_Hw_is_CCU8_active( void )
{
    return m_CCU8_power_status;
}

/**********************************************************************************************************************/
/******************************************************B O O S T*******************************************************/
/**********************************************************************************************************************/

void BoostPFC_HwInit (void)
{
    BoostPFC_Buck_HwInit();
}


/* internal function */
/* configure CC82 timer slice for generating gate-drive signal of BoostPFC transistor */
static void BoostPFC_HwCC82Init (void)
{
    //----CCU8 Slice2 (CC82) SETUP----------------------------------------------------------------------------------------
    // TRAP function used for limiting on-time when "overcurrent" event at pfc shunt occurs
    // dead time is required, to prevent false ZCD detection when period is reached and PFC-MOSFET is switched on again (ZCD-gating not active at the beginning of the period)

    CCU80_CC82->TC   |= ( 1 << CCU8_CC8_TC_CLST_Pos)   | // set the CLST-Bit to activate shadow transfer on timer clear, otherwise new period and compare values are never updated without a period match
                        // should not be needed, because there will always be a period match because ZCD loads compare2 with period value in boundary mode instead of resetting the timer
                        ( 1 << CCU8_CC8_TC_TLS_Pos)    | // Set Timer Load with compare 2 value (pfc_max_period - t_off_adder)
                        ( 1 << CCU8_CC8_TC_TRAPE1_Pos) | // enable TRAP for CCU80.OUT21 (PFC_GATE)
                        ( 1 << CCU8_CC8_TC_TRPSE_Pos)  ; // exit TRAP state synchronized to PWM signal (on-time is limited)

    CCU80_CC82->INS  |= ( 1 << CCU8_CC8_INS_EV0IS_Pos) | // Configure Event 0 to ZCD P0.10 (CCU80.IN2B)
                        ( 2 << CCU8_CC8_INS_EV0EM_Pos) | // Configure external load feature falling edge (ZCD)
                        ( 3 << CCU8_CC8_INS_LPF0M_Pos) ; // enable low pass filtering of 7 clock cycles for Event 0 – t_filter = 105ns

    CCU80_CC82->CMC  |= ( 1 << CCU8_CC8_CMC_LDS_Pos)   | // Set Timer Load when event 0 (ZCD) occurs
                        ( 1  << CCU8_CC8_CMC_TS_Pos)   ; // enable TRAP (triggered by event 2)

    CCU80_CC82->DTC  |= ( 1 << CCU8_CC8_DTC_DTE2_Pos)  | // enable dead time channel 2
                        ( 1 << CCU8_CC8_DTC_DCEN4_Pos) ; // enable dead time for inverted CC8yST2

    CCU80_CC82->DC2R |=   64 << CCU8_CC8_DC2R_DT2F_Pos ; // set dead time for CC8yST2 fall value: 1000ns@64MHz

// Max: funktioniert nicht, weil man nur mit CCU80.SR0 oder SR1 eine Verbindung zum NVIC herstellen kann
//  CCU80_CC82->INTE = ( 1 << CCU8_CC8_INTE_CM1UE_Pos);
//  CCU80_CC82->SRS = ( 2 << CCU8_CC8_SRS_CM1SR_Pos);
//
//  // enable IRQ for CCU80.SR0 (period match CC81)
//  // CC81: clear all interrupts
//  CCU80_CC82->SWR = 0x00000F3FU;
//  NVIC_ClearPendingIRQ(CCU80_1_IRQn);
//  NVIC_EnableIRQ(CCU80_1_IRQn);
}


void BoostPFC_HwUpdateTimer (uint32_t pfc_on, uint32_t pfc_off_adder, uint32_t pfc_demag_max)
{
    CCU80_CC82->PRS  = (pfc_on + pfc_demag_max);                 // set period for CC82
    CCU80_CC82->CR1S = (pfc_on);                                 // set compare1 for CC82
    CCU80_CC82->CR2S = (pfc_on + pfc_demag_max - pfc_off_adder); // set compare2 for CC82
    CCU80->GCSS = CCU8_GCSS_S2SE_Msk;                            // request shadow transfer for CC82
}


void BoostPFC_HwReset2Off (void)
{
    // Port change not necessary, because they are already set to safe state inside ControllerInit()
    P0_9_set_mode(OUTPUT_PP_GP);                                 // set P0.9 (PFC_GATE) to GPIO
    P0_9_reset();                                                // set P0.9 (PFC_GATE) to low
    P0_10_set_mode(INPUT);		                                   // PFC_RETRIGGER
    P0_12_set_mode(INPUT_PU);                                    // PFC_SHUNT_CMP_OUT (CCU80.IN1A)
}


void BoostPFC_HwDeepsleep2Ready (void)
{
    boostpfc_deepsleep_requested = 0;
    BoostPFC_Buck_HwDeepsleep2Ready();
}


void BoostPFC_HwReady2Run (void)
{
}


void BoostPFC_HwRun2Ready (void)
{
    BoostPFC_HwUpdateTimer (PFC_ON_MIN, 0, PFC_DEMAG_MAX);       // GDI pulses to keep FAN3182 in run mode, no gate drive
}


void BoostPFC_HwRun2ReadyWithoutZCD (void)
{
    P0_9_set_mode(OUTPUT_PP_GP);                                                  // set P0.9  (PFC_GATE) to GPIO
    WR_REG(CCU80_CC82->INS, CCU8_CC8_INS_EV0EM_Msk, CCU8_CC8_INS_EV0EM_Pos, 0);   // disable ZCD event
    CCU80_CC82->SWR = 0x00000F3FU;                                                // clear event flags
    CCU80_CC82->TCCLR = (1 << CCU8_CC8_TCCLR_TCC_Pos) |                           // Stop and Clear Timer
                        (1 << CCU8_CC8_TCCLR_TRBC_Pos);
    BoostPFC_HwUpdateTimer (PFC_ON_MIN, 0, PFC_DEMAG_MAX_INTERMEDIATE);           // GDI pulses to keep FAN3182 in run mode, no gate drive

    CCU80_CC82->TCSET = (1 << CCU8_CC8_TCSET_TRBS_Pos);                           // Start Timer
    P0_9_set_mode(OUTPUT_PP_AF5);
    BoostPFC_HwUpdateTimer (PFC_ON_MIN, 0, PFC_DEMAG_MAX_SURGE);                  // GDI pulses to keep FAN3182 in run mode, no gate drive
}


void BoostPFC_HwEnableZCD (void)
{
    WR_REG(CCU80_CC82->INS, CCU8_CC8_INS_EV0EM_Msk, CCU8_CC8_INS_EV0EM_Pos, 2);   // enable ZCD event
}


void BoostPFC_HwGateSwitchOff (void)
{
    P0_9_set_mode(OUTPUT_PP_GP);                                                  // set P0.9  (PFC_GATE) to GPIO
    P0_9_reset();                                                                 // set P0.9  (PFC_GATE) to low
}


void BoostPFC_HwGateSwitchOn (void)
{
    P0_9_set_mode(OUTPUT_PP_GP);
    WR_REG(CCU80_CC82->INS, CCU8_CC8_INS_EV0EM_Msk, CCU8_CC8_INS_EV0EM_Pos, 0);   // disable ZCD event
    CCU80_CC82->SWR = 0x00000F3FU;                                                // clear event flags
    CCU80_CC82->TCCLR = (1 << CCU8_CC8_TCCLR_TCC_Pos) |                           // Stop and Clear Timer
                        (1 << CCU8_CC8_TCCLR_TRBC_Pos);
    BoostPFC_HwUpdateTimer (PFC_ON_MIN, 0, PFC_DEMAG_MAX_INTERMEDIATE);           // GDI pulses to keep FAN3182 in run mode, no gate drive

    CCU80_CC82->TCSET = (1 << CCU8_CC8_TCSET_TRBS_Pos);                           // Start Timer
    P0_9_set_mode(OUTPUT_PP_AF5);
    BoostPFC_HwUpdateTimer (PFC_ON_MIN, 0, PFC_DEMAG_MAX_SURGE);                  // GDI pulses to keep FAN3182 in run mode, no gate drive
}


void BoostPFC_HwReady2Deepsleep (void)
{
    boostpfc_deepsleep_requested = 1;
    BoostPFC_Buck_HwReady2Deepsleep();
}


uint32_t BoostPFC_HwQueryCmpEvent (void)
{
    return 0;
}

uint32_t BoostPFC_HwGetDemagTime (void)
{
    return 0;
}

void BoostPFC_HwActivateCapture (void)
{
//  CCU80_CC83->INS  |= (15 << CCU8_CC8_INS_EV0IS_Pos) |   // event 0 (external start): (CCU80.IN3P) (CCU80.ST2 - at compare 1 match of boost timer)
//                      ( 1 << CCU8_CC8_INS_EV0EM_Pos) |   // event 0 (external start): rising edge (CCU80.IN3P) (CCU80.ST2 - at compare 1 match of boost timer)
//                      (15 << CCU8_CC8_INS_EV1IS_Pos) |   // event 1 (CCU80.IN1F) (CCU80.IN3P) (CCU80.ST2 - at compare 1 match of boost timer)
//                      ( 2 << CCU8_CC8_INS_EV1EM_Pos) ;   // event 1 (capt0): falling edge (CCU80.IN3P) (CCU80.ST2 - at ZCD of boost)
}


void BoostPFC_HwTriggerCapture (void)
{
}

/**********************************************************************************************************************/
/********************************************************B U C K ******************************************************/
/**********************************************************************************************************************/

