Jiangchunjun/Project_NFC_1_10V/Application/src/hwdrivers/XMC1300/xmc1300_boostpfc_buck_hwdriver.c
/* internal function */
static void Buck_HwCC42Init (void)
{
    // set prescaler to 2 --> 32 MHz
    CCU40_CC42->PSC  |= ( 1 << CCU4_CC4_PSC_PSIV_Pos);

    // set edge aligned mode with single shot enabled
    CCU40_CC42->TC   |= ( 1 << CCU4_CC4_TC_TSSM_Pos);

    CCU40_CC42->CRS = 0;
    CCU40_CC42->PRS = 0xFFFF;
    // set shadow transfer request for CC42
    CCU40->GCSS = CCU4_GCSS_S2SE_Msk;

    // EV0IS = 10: event 0 (external start + external stop) CCU80.SR3->ERU.IOUT2->CCU40.IN2K
    // EV0EM = 1 : event 0 (external start + external stop): rising edge
    CCU40_CC42->INS  |= (10 << CCU4_CC4_INS_EV0IS_Pos) |
                        ( 1 << CCU4_CC4_INS_EV0EM_Pos) ;

    CCU40_CC42->CMC  |= ( 1 << CCU4_CC4_CMC_STRTS_Pos) ;
//                        ( 1 << CCU4_CC4_CMC_ENDS_Pos)  ;
}


uint32_t SCU_2_INTERRUPT_BOOSTPFC_ORC_REC_flag = 0;
uint32_t SCU_2_INTERRUPT_BOOSTPFC_ORC_RAIL_flag = 0;
uint32_t SCU_2_INTERRUPT_BUCK_ORC_RAIL_flag = 0;


uint32_t BoostPFC_HwRead_ORC_REC_flag(void)
{
    return SCU_2_INTERRUPT_BOOSTPFC_ORC_REC_flag;
}

uint32_t BoostPFC_HwRead_ORC_RAIL_flag(void)
{
    return SCU_2_INTERRUPT_BOOSTPFC_ORC_RAIL_flag;
}

void BoostPFC_HwClear_ORC_REC_flag(void)
{
    SCU_2_INTERRUPT_BOOSTPFC_ORC_REC_flag = 0;
}

void BoostPFC_HwClear_ORC_RAIL_flag(void)
{
    SCU_2_INTERRUPT_BOOSTPFC_ORC_RAIL_flag = 0;
}

void BoostPFC_HwEnable_ORC_REC_Interrupt(void)
{
    SET_BIT(SCU_INTERRUPT->SRCLR, SCU_INTERRUPT_SRCLR_ORC2I_Pos);                 // clear the event status flag
    SET_BIT(SCU_INTERRUPT->SRMSK, SCU_INTERRUPT_SRMSK_ORC2I_Pos);                 // enable the interrupt trigger source
    SET_BIT(SCU_INTERRUPT->SRCLR, SCU_INTERRUPT_SRCLR_ORC3I_Pos);                 // clear the event status flag
    SET_BIT(SCU_INTERRUPT->SRMSK, SCU_INTERRUPT_SRMSK_ORC3I_Pos);                 // enable the interrupt trigger source
}

void BoostPFC_HwEnable_ORC_RAIL_Interrupt(void)
{
    SET_BIT(SCU_INTERRUPT->SRCLR, SCU_INTERRUPT_SRCLR_ORC1I_Pos);                 // clear the event status flag
    SET_BIT(SCU_INTERRUPT->SRMSK, SCU_INTERRUPT_SRMSK_ORC1I_Pos);                 // enable the interrupt trigger source
}




#endif
/** @}  End of group BUCK */
